<html>
    <head>
        <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
        <title>GDB User Manual</title>
        <link rel="stylesheet" type="text/css" href="css/font-awesome.min.css">
        <link rel="stylesheet" type="text/css" href="css/inote_md2.css">
        <link rel="stylesheet" type="text/css" href="css/inote_md_tb1.css">
        <link rel="stylesheet" type="text/css" href="css/bootstrap.css">
        <link rel="stylesheet" type="text/css" href="css/style.css">
        <link rel="stylesheet" type="text/css" href="css/blog_all.css">
        
    </head>

<!-- Google tag (gtag.js) -->
<script async src="https://www.googletagmanager.com/gtag/js?id=G-PCRLYHSNM7"></script>
<script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'G-PCRLYHSNM7');
</script>
    
<body>
    <div id="in-main">
        <h1 style="text-align:center">GDB User Manual</h1>
        <span class="published">
            <i class="fa fa-calendar"></i>
            <time>2023-06-05</time>
            <i><a href="../tags/gdb.html" target="_blank" id="inlntag"><i class="fa fa-tags fa-fw"></i>gdb</a>&nbsp;<a href="../tags/gdb-doc.html" target="_blank" id="inlntag"><i class="fa fa-tags fa-fw"></i>gdb-doc</a>&nbsp;</i>
        </span>
        <br/><br/>
        <div id="in-ttb"><ol>
<a name="HEAD_todo">TODO:</a>

		If arg is an expression (see Expressions), it is not actually evaluated, and any side&ndash;effecting operations (such as assignments or function calls) inside it do not take place.
	</p>
	<p>
		If arg is a variable or an expression, whatis prints its literal type as it is used in the source code. If the type was defined using a typedef, whatis will not print the data type underlying the typedef. If the type of the variable or the expression is a compound data type, such as struct or class, whatis never prints their fields or methods. It just prints the struct/class name (a.k.a. its tag). If you want to see the members of such a compound data type, use ptype.
	</p>
	<p>
		If arg is a type name that was defined using typedef, whatis unrolls only one level of that typedef. Unrolling means that whatis will show the underlying type used in the typedef declaration of arg. However, if that underlying type is also a typedef, whatis will not unroll it.
	</p>
	<p>
		For C code, the type names may also have the form &lsquo;class class&ndash;name&rsquo;, &lsquo;struct struct&ndash;tag&rsquo;, &lsquo;union union&ndash;tag&rsquo; or &lsquo;enum enum&ndash;tag&rsquo;.
	</p>
	<p>
		flags can be used to modify how the type is displayed. Available flags are:
	</p>
	<ul>
		<li>r</li>
		<br />
		<p>
			Display in &ldquo;raw&rdquo; form. Normally, GDB substitutes template parameters and typedefs defined in a class when printing the class&rsquo; members. The /r flag disables this.
		</p>
		<li>m</li>
		<br />
		<p>
			Do not print methods defined in the class.
		</p>
		<li>M</li>
		<br />
		<p>
			Print methods defined in the class. This is the default, but the flag exists in case you change the default with set print type methods.
		</p>
		<li>t</li>
		<br />
		<p>
			Do not print typedefs defined in the class. Note that this controls whether the typedef definition itself is printed, not whether typedef names are substituted when printing other types.
		</p>
		<li>T</li>
		<br />
		<p>
			Print typedefs defined in the class. This is the default, but the flag exists in case you change the default with set print type typedefs.
		</p>
		<li>o</li>
		<br />
		<p>
			Print the offsets and sizes of fields in a struct, similar to what the pahole tool does. This option implies the /tm flags.
		</p>
		<li>x</li>
		<br />
		<p>
			Use hexadecimal notation when printing offsets and sizes of fields in a struct.
		</p>
		<li>d</li>
		<br />
		<p>
			Use decimal notation when printing offsets and sizes of fields in a struct.
		</p>
		<p>
			For example, given the following declarations:
		</p>
		<pre><code>struct tuv
{
int a1;
char *a2;
int a3;
};

struct xyz
{
int f1;
char f2;
void *f3;
struct tuv f4;
};

union qwe
{
struct tuv fff1;
struct xyz fff2;
};

struct tyu
{
int a1 : 1;
int a2 : 3;
int a3 : 23;
char a4 : 2;
int64_t a5;
int a6 : 5;
int64_t a7 : 3;
};		</code></pre>
		<p>
			Issuing a ptype /o struct tuv command would print:
		</p>
		<pre><code>(gdb) ptype /o struct tuv
/* offset      |    size */  type = struct tuv {
/*      0      |       4 */    int a1;
/* XXX  4-byte hole      */
/*      8      |       8 */    char *a2;
/*     16      |       4 */    int a3;

                            /* total size (bytes):   24 */
                            }		</code></pre>
		<p>
			Notice the format of the first column of comments. There, you can find two parts separated by the &lsquo;|&rsquo; character: the offset, which indicates where the field is located inside the struct, in bytes, and the size of the field. Another interesting line is the marker of a hole in the struct, indicating that it may be possible to pack the struct and make it use less space by reorganizing its fields.
		</p>
		<p>
			It is also possible to print offsets inside an union:
		</p>
		<pre><code>(gdb) ptype /o union qwe
/* offset      |    size */  type = union qwe {
/*                    24 */    struct tuv {
/*      0      |       4 */        int a1;
/* XXX  4-byte hole      */
/*      8      |       8 */        char *a2;
/*     16      |       4 */        int a3;

                                /* total size (bytes):   24 */
                            } fff1;
/*                    40 */    struct xyz {
/*      0      |       4 */        int f1;
/*      4      |       1 */        char f2;
/* XXX  3-byte hole      */
/*      8      |       8 */        void *f3;
/*     16      |      24 */        struct tuv {
/*     16      |       4 */            int a1;
/* XXX  4-byte hole      */
/*     24      |       8 */            char *a2;
/*     32      |       4 */            int a3;

                                    /* total size (bytes):   24 */
                                } f4;

                                /* total size (bytes):   40 */
                            } fff2;

                            /* total size (bytes):   40 */
                            }		</code></pre>
		<p>
			In this case, since struct tuv and struct xyz occupy the same space (because we are dealing with an union), the offset is not printed for them. However, you can still examine the offset of each of these structures&rsquo; fields.
		</p>
		<p>
			Another useful scenario is printing the offsets of a struct containing bitfields:
		</p>
		<pre><code>(gdb) ptype /o struct tyu
/* offset      |    size */  type = struct tyu {
/*      0:31   |       4 */    int a1 : 1;
/*      0:28   |       4 */    int a2 : 3;
/*      0: 5   |       4 */    int a3 : 23;
/*      3: 3   |       1 */    signed char a4 : 2;
/* XXX  3-bit hole       */
/* XXX  4-byte hole      */
/*      8      |       8 */    int64_t a5;
/*     16: 0   |       4 */    int a6 : 5;
/*     16: 5   |       8 */    int64_t a7 : 3;
/* XXX  7-byte padding   */

                            /* total size (bytes):   24 */
                            }		</code></pre>
		<p>
			Note how the offset information is now extended to also include the first bit of the bitfield.
		</p>
	</ul>
	<li>ptype[/flags] [arg]</li>
	<br />
	<p>
		ptype accepts the same arguments as whatis, but prints a detailed description of the type, instead of just the name of the type. See Expressions.
	</p>
	<p>
		Contrary to whatis, ptype always unrolls any typedefs in its argument declaration, whether the argument is a variable, expression, or a data type. This means that ptype of a variable or an expression will not print literally its type as present in the source code&mdash;use whatis for that. typedefs at the pointer or reference targets are also unrolled. Only typedefs of fields, methods and inner class typedefs of structs, classes and unions are not unrolled even with ptype.
	</p>
	<p>
